{
  "author": "YuzzuKamiyaka",
  "result": {
    "status": 200,
    "hero_name": " ( Onmyouji Master )",
    "entrance_quotes": "Urana tte age you ka!",
    "hero_feature": "Kagura is an Adorable Ninja that manipulates both Yin and Yang using her Umbrella",
    "image": "https://static.wikia.nocookie.net/mobile-legends/images/9/9d/Onmyouji_Master_%28rework%29.jpg/revision/latest?cb=20210904133148",
    "items": [],
    "character": {
      "chara": [
        "AliasOnmyouji Master",
        "FactionOnmyouji Clan"
      ]
    },
    "attributes": {
      "movement_speed": "● HP2556",
      "physical_attack": "● Mana519",
      "magic_power": "● HP Regen7",
      "attack_speed": "● Mana  Regen21",
      "physical_defense": "● Physical Attack118",
      "magic_defense": "● Magic Power0",
      "basic_atk_crit_rate": "● Physical Defense19",
      "hp": "● Magic Defense10",
      "mana": "● Attack Speed1.02",
      "ability_crit_rate": "● Movement SPD240",
      "hp_regen": "● Attack Speed100%",
      "mana_regen": "Hero FeatureKagura is an Adorable Ninja that manipulates both Yin and Yang using her Umbrella"
    },
    "price": {
      "battle_point": "32,000",
      "diamond": "599",
      "hero_fragment": "none"
    },
    "role": "Mage",
    "skill": {
      "durability": "58%;",
      "offense": "42%;",
      "skill_effects": "90%;",
      "difficulty": "78%;"
    },
    "speciality": "Poke  |  Reap",
    "laning_recommendation": "Mid Lane",
    "release_date": "2016",
    "background_story": "Upon the Cadia Riverlands, there exists a mysterious profession called Onmyouji Master that uses the yin yang arts to control spirits and see into the future. The Great Dragon bestowed this special power to channel yin and yang on people of the Cadia Riverlands, and one of his own disciples became the first-ever Onmyouji Master.\n\nThere was once an Onmyouji Master named Seimei, so powerful that he could control spirits and even bring the dead back to life. Many legends were told about him: some said he followed the Great Dragon to the Dragon Altar and learned the greatest yin yang arts, some said he once assisted the first Akakage in sealing the demonic Hanekage, and some even said he'd lived to this day with secret yin yang arts...\n\nTo Seimei's descendants, the most precious legacy from their great ancestor is the Seimei Umbrella that can transform into different shapes. The umbrella was refined by the great Seimei himself using power from a hundred ghosts. It is believed that it now possesses life and wisdom of its own, allowing it to choose its own rightful owner.\n\nFor years, the Seimei Umbrella lay quietly inside the shrine. Every year at the memorial for Seimei, people would sincerely pray to it on their knees, wishing for better mastery of the yin yang arts. But centuries passed, and the Seimei Umbrella never once showed any miracle.\n\nEverything was changed when Kagura, the descendant of Seimei, stepped into the shrine to pray for the first time.\n\nBefore the ceremony started, the naughty orphan girl secretly climbed up a tree outside the shrine to sneak a peek at the altar inside.\n\nWhen half way up on the tree, she was spotted by a boy a little older than her. The boy named  Hayabusa was the son of the Shadow Supreme Grandmaster from the Scarlet Shadow, here on an invitation with his family. He had no interest in the complicated ritual either and happened to see Kagura climbing up the tree when looking around out of boredom. Before Kagura could cheer for finally climbing up to the top, the grown-ups on the ground had spotted her and each began scolding her for possibly angering the great ancestor. But the little girl refused to admit her fault and argued that she only climbed the tree because she heard somebody calling out for her over at the altar.\n\nAs their arguments got heated, filled with indignation, Kagura slipped and fell head down first off the tree!  Hayabusa immediately rushed to the tree trunk with his ninjutsu and leapt up to hold her by her waist. At the very moment, a large umbrella bloomed above Kagura and  Hayabusa, and the two kids reached out to the handle at once, safely landing like a floating dandelion tuft.\n\n\"I-It's the Seimei Umbrella!\"\n\n\"A miracle from the Seimei Umbrella!\"\n\nThe crowd exclaimed in surprise, while Kagura stared at the big umbrella in her hand and smiled: \"So, it was you who were calling for me...\"\n\nThe Seimei Umbrella kept Kagura's company from then on. It witnessed every trouble she'd ever caused, experienced all her joy, sadness and anger as she gradually grew up, and understood her feelings for  Hayabusa which changed from friendship to secret affection...\n\nWhen Kagura dressed up to attend  Hayabusa's coming-of-age ceremony, she accidentally heard their seniors talking and realized why  Hayabusa became distant recently—\"Is he going to leave the Cadia Riverlands, and also to leave me?\"\n\n\"So, what should I do?\"\n\nHolding back her tears, Kagura stared at the evening rain outside her window, when the Seimei Umbrella had already flown out and opened on its own. \"Right, the Seimei Umbrella is right—I'll find him and follow him to the ends of the world!\"\n\nKagura sneaked out of her house and ran toward  Hayabusa in the pouring rain. It could be the biggest trouble she'd ever caused, but it'd also be the biggest bet she'd ever placed.\n\nThunder roared and lightning flashed along the long road. But Kagura didn't care, because she could go on an adventure with  Hayabusa, and with the Seimei Umbrella!\n\nOn the street of the Scarlet Shadow, Kagura stopped  Hayabusa just after he left home and said: \" Hayabusa, I'll go with you!\"\n\nAs  Hayabusa's name left her mouth, the young girl that needed the big brother's help was no more. Whether the oblivious  Hayabusa had realized it or not, Kagura had become an all-new person to travel the world with him...\n"
  }
}